<!-- attach-outputs:plan-nodes-test.txt -->
  <!-- Output: plan-nodes-test.txt -->
  #### plan-nodes-test.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 19, 2026, 11:28 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7421"
        name                                 = "tiles-test-wk"
      ~ network_interface_names              = [
            # (36 unchanged elements hidden)
            "lxc2e1ae88ad494",
          ~ "lxc2933cd1b060b" -> "lxc0137cbab8cf4",
          ~ "lxc0137cbab8cf4" -> "lxc449d89bf82ec",
          ~ "lxc449d89bf82ec" -> "lxcf137af09db8b",
          ~ "lxcf137af09db8b" -> "lxcfa95a71ab46f",
        ]
        tags                                 = []
        # (33 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cluster.module.talos-vm["tiles-test-cp"].talos_machine_configuration_apply.this will be updated in-place
  ~ resource "talos_machine_configuration_apply" "this" {
        id                          = "machine_configuration_apply"
      + resolved_apply_mode         = "auto"
        # (7 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].unifi_client.vm_client will be created
  + resource "unifi_client" "vm_client" {
      + allow_existing         = true
      + anomalies              = (known after apply)
      + assoc_time             = (known after apply)
      + authorized             = (known after apply)
      + blocked                = false
      + dev_id_override        = (known after apply)
      + disconnect_timestamp   = (known after apply)
      + eagerly_discovered     = (known after apply)
      + fingerprint_override   = (known after apply)
      + first_seen             = (known after apply)
      + fixed_ip               = "10.0.192.11"
      + gateway                = (known after apply)
      + group_id               = (known after apply)
      + guest_status           = (known after apply)
      + hostname               = (known after apply)
      + hostname_source        = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + ipv6_addresses         = (known after apply)
      + is_wired               = (known after apply)
      + last                   = (known after apply)
      + latest_assoc_time      = (known after apply)
      + local_dns_record       = "tiles-test-cp.local.symmatree.com."
      + mac                    = "bc:24:11:d0:74:11"
      + name                   = "tiles-test-cp"
      + network                = (known after apply)
      + network_id             = "643f0d49364f930b6077d96c"
      + note                   = "Control - 7411 - tiles-test-cp"
      + noted                  = (known after apply)
      + oui                    = (known after apply)
      + qos_policy_applied     = (known after apply)
      + satisfaction           = (known after apply)
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
      + switch                 = (known after apply)
      + tx_retries             = (known after apply)
      + uptime                 = (known after apply)
      + uptime_stats           = (known after apply)
      + user_id                = (known after apply)
      + vlan                   = (known after apply)
      + wifi                   = (known after apply)
      + wired                  = (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].talos_machine_configuration_apply.this will be updated in-place
  ~ resource "talos_machine_configuration_apply" "this" {
        id                          = "machine_configuration_apply"
      + resolved_apply_mode         = "auto"
        # (7 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].unifi_client.vm_client will be created
  + resource "unifi_client" "vm_client" {
      + allow_existing         = true
      + anomalies              = (known after apply)
      + assoc_time             = (known after apply)
      + authorized             = (known after apply)
      + blocked                = false
      + dev_id_override        = (known after apply)
      + disconnect_timestamp   = (known after apply)
      + eagerly_discovered     = (known after apply)
      + fingerprint_override   = (known after apply)
      + first_seen             = (known after apply)
      + fixed_ip               = "10.0.192.21"
      + gateway                = (known after apply)
      + group_id               = (known after apply)
      + guest_status           = (known after apply)
      + hostname               = (known after apply)
      + hostname_source        = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + ipv6_addresses         = (known after apply)
      + is_wired               = (known after apply)
      + last                   = (known after apply)
      + latest_assoc_time      = (known after apply)
      + local_dns_record       = "tiles-test-wk.local.symmatree.com."
      + mac                    = "bc:24:11:d0:74:21"
      + name                   = "tiles-test-wk"
      + network                = (known after apply)
      + network_id             = "643f0d49364f930b6077d96c"
      + note                   = "Worker - 7421 - tiles-test-wk"
      + noted                  = (known after apply)
      + oui                    = (known after apply)
      + qos_policy_applied     = (known after apply)
      + satisfaction           = (known after apply)
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
      + switch                 = (known after apply)
      + tx_retries             = (known after apply)
      + uptime                 = (known after apply)
      + uptime_stats           = (known after apply)
      + user_id                = (known after apply)
      + vlan                   = (known after apply)
      + wifi                   = (known after apply)
      + wired                  = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

  ```

  </details>
  
  